# Эти задачи необходимо решить используя регулярные выражения!

# Задача - 1
# Запросите у пользователя имя, фамилию, email. Теперь необходимо совершить проверки,
# имя и фамилия должны иметь заглавные первые буквы.
# email - не должен иметь заглавных букв и должен быть в формате: текст в нижнем регистре,
# допускается нижнее подчеркивание и цифры, потом @, потом текст, допускаются цифры, точка, ru или org или com.
# Например:
# Пупкин василий - неверно указано имя, te$T@test.net - неверно указан email
# (спецсимвол, заглавная буква, .net), te_4_st@test.com - верно указан.
# import re
# name = input('Имя:')
# surname = input('Фамилия:')
# email = input('введите емайл')
# pattern = '[A-Z]'
# epattern = '[a-z_0-9]+@[a-z]+\.(ru|org|com)'
# res1 = re.match(pattern, name[0])
# res2 = re.match(pattern, surname[0])
# if res1 is None:
#     print('Неверно указали Имя, должно начинаться с заглавной буквы')
# if res2 is None:
#     print('Неверно указали Фамилию, должно начинаться с заглавной буквы')
# if re.match(epattern,email):
#     print('Неверно указан email, может содержать _ строчные буквы и цифры, домен только ru com org')

# Задача - 2:
# Вам дан текст:

some_str = '''
Мороз и солнце; день чудесный!
Еще ты дремлешь, друг прелестный —
Пора, красавица, проснись:
Открой сомкнуты негой взоры
Навстречу северной Авроры,
Звездою севера явись!
Вечор, ты помнишь, вьюга злилась,
На мутном небе мгла носилась;
Луна, как бледное пятно,
Сквозь тучи мрачные желтела,
И ты печальная сидела —
А нынче... погляди в окно:
Под голубыми небесами
Великолепными коврами,
Блестя на солнце, снег лежит;
Прозрачный лес один чернеет,
И ель сквозь иней зеленеет,
И речка подо льдом блестит.
Вся комната янтарным блеском
Озарена. Веселым треском
Трещит затопленная печь.
Приятно думать у лежанки.
Но знаешь: не велеть ли в санки
Кобылку бурую запречь?
Скользя по утреннему снегу,
Друг милый, предадимся бегу
Нетерпеливого коня
И навестим поля пустые,
Леса, недавно столь густые,
И берег, милый для меня.'''

# Необходимо с помощью регулярных выражений определить есть ли в тексте подряд
# более одной точки, при любом исходе сообщите результат пользователю!
import re
strpattern = '\.\.\.'
if re.findall(strpattern,some_str):
    print('в вашем тексте есть подряд 3 точки!')
else:
    print('в вашем выражении нет подряд 3-х точек')
